---
kind: method
id: M:Autodesk.Revit.DB.Rectangle.#ctor
source: html/41ab4079-28ae-7edc-81d4-ab5ad14b6ccb.htm
---
# Autodesk.Revit.DB.Rectangle.#ctor Method

Create an empty Rectangle instance with values (0,0,0,0).

## Syntax (C#)
```csharp
public Rectangle()
```